# Que-Ans

### Q.1  Write a Pandas program to detect missing values of a given DataFrame. Display True or False.

In [1]:
import pandas as pd
import numpy as np

In [2]:
df = pd.DataFrame(
        np.random.randn(5, 2),           # randn generates an array of shape (d0, d1, ..., dn)
        index=["a", "c", "e", "f", "h"],
        columns=["girls", "boys"],
    )

df

      girls      boys
a -0.926792  0.162315
c -0.141342 -0.288034
e  0.507601 -0.704900
f  0.816818  0.428168
h -0.677449 -0.682128

In [3]:
df2 = df.reindex(["a", "b", "c", "d", "e", "f", "g", "h"])
df2

      girls      boys
a -0.926792  0.162315
b       NaN       NaN
c -0.141342 -0.288034
d       NaN       NaN
e  0.507601 -0.704900
f  0.816818  0.428168
g       NaN       NaN
h -0.677449 -0.682128

In [4]:
df2["girls"]

a   -0.926792
b         NaN
c   -0.141342
d         NaN
e    0.507601
f    0.816818
g         NaN
h   -0.677449
Name: girls, dtype: float64

In [5]:
df2["girls"].notna()             #notna- detects missing values

a     True
b    False
c     True
d    False
e     True
f     True
g    False
h     True
Name: girls, dtype: bool

### 2. Write a Pandas program to identify the column(s) of a given DataFrame which have at least one missing value.

In [7]:
df2["four"] = "bar"
df3 = df2.reindex(["a", "b", "c", "d", "e", "f", "g", "h","i"])
df3

      girls      boys four
a -0.926792  0.162315  bar
b       NaN       NaN  bar
c -0.141342 -0.288034  bar
d       NaN       NaN  bar
e  0.507601 -0.704900  bar
f  0.816818  0.428168  bar
g       NaN       NaN  bar
h -0.677449 -0.682128  bar
i       NaN       NaN  NaN

In [6]:
df2.fillna('1.1')

      girls      boys
a -0.926792  0.162315
b       1.1       1.1
c -0.141342 -0.288034
d       1.1       1.1
e  0.507601   -0.7049
f  0.816818  0.428168
g       1.1       1.1
h -0.677449 -0.682128

###  Q3.  Write a Pandas program to drop the rows where all elements are missing in a given DataFrame.

In [8]:

df2 = df.reindex(["a", "c", "e", "f", "g", "h"])
df2

      girls      boys
a -0.926792  0.162315
c -0.141342 -0.288034
e  0.507601 -0.704900
f  0.816818  0.428168
g       NaN       NaN
h -0.677449 -0.682128

In [9]:
df2.dropna()

      girls      boys
a -0.926792  0.162315
c -0.141342 -0.288034
e  0.507601 -0.704900
f  0.816818  0.428168
h -0.677449 -0.682128

###  Q 4.  Write a Pandas program to calculate the total number of missing values in a DataFrame.

In [13]:
df2.isnull().sum().sum()        #used for a no missing values in whole data

2

In [14]:
df2.isnull().sum()

girls    1
boys     1
dtype: int64

###  Q5.  Write a Pandas program to replace NaNs with median or mean of the specified columns in a given DataFrame.

In [15]:
df2.describe()

          girls      boys
count  5.000000  5.000000
mean  -0.084233 -0.216916
std    0.746196  0.504866
min   -0.926792 -0.704900
25%   -0.677449 -0.682128
50%   -0.141342 -0.288034
75%    0.507601  0.162315
max    0.816818  0.428168

In [16]:
df2.fillna('0.152368')

      girls      boys
a -0.926792  0.162315
c -0.141342 -0.288034
e  0.507601   -0.7049
f  0.816818  0.428168
g  0.152368  0.152368
h -0.677449 -0.682128